In [1]:
#Someone_giving_Data-containing_Malformed String's Python ,list and Missing Data:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN','londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                   'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                   'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )','12. Air France', '"Swiss Air"']})
print("\n Output:- \n",df1)

 Output:-
             From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

1.Some_values in the the FlightNumber column are missing.These numbers are meant to increase by 10 with each row so 10055 and    10075 need to be put in place.Fill in these missing numbers and make the column an integer column(instead of a float Column).

In [2]:
x,y = df1.FlightNumber.loc[[0]].values[0]+10, df1.FlightNumber.loc[[4]].values[0]-10
df1.FlightNumber.loc[[1]]=df1.FlightNumber.loc[[1]].fillna(x)
df1.FlightNumber.loc[[3]]=df1.FlightNumber.loc[[3]].fillna(y)

#_Now_Convert_float type to int type:-
df1.FlightNumber = df1.FlightNumber.astype(int)
print("\nOutput:-\n",df1)

Output:-
             From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

C:\Users\Soumya\anaconda3\lib\site-packages\pandas\core\indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

2.The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new   temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame.

In [3]:
df1['From_To']

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [4]:
df2=df1.From_To.str.split('_',expand=True)
df2.columns=['From','To']
print("\nOutput:-\n",df2)

Output:-
        From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that    only the first letter is uppercase (e.g. "londON" should become "London".)

In [6]:
#tittle_Parameter Standardise the String So,that only_First_letter is upper-case:-
df2.From=df2.From.str.title()
df2.To=df2.To.str.title()
print("\nOutput:-\n",df2)

Output:-
        From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions.

In [7]:
print(df1)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [8]:
df1=df1.drop("From_To",axis=1).join(df2)
print("\noutput\n",df1)

output
    FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

5.In_the RecentDelays-column, the values have been entered into the DataFrame as a list. We would like each first value in its   own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN.
  Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted   RecentDelays column in df_with delays.

In [9]:
delays=pd.DataFrame(df1["RecentDelays"].values.tolist())
delays.columns=['delays_{}'.format(i) for i in range(1,len(delays.columns)+1)]
print("\nOutput:-\n",delays)

Output:-
    delays_1  delays_2  delays_3
0      23.0      47.0       NaN
1       NaN       NaN       NaN
2      24.0      43.0      87.0
3      13.0       NaN       NaN
4      67.0      32.0       NaN

In [10]:
print(df1)

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [11]:
df1=df1.drop("RecentDelays",axis=1).join(delays)
print("\n output:-\n",df1)

 output:-
    FlightNumber              Airline      From         To  delays_1  delays_2  \
0         10045               KLM(!)    London      Paris      23.0      47.0
1         10055    <Air France> (12)    Madrid      Milan       NaN       NaN
2         10065  (British Airways. )    London  Stockholm      24.0      43.0
3         10075       12. Air France  Budapest      Paris      13.0       NaN
4         10085          "Swiss Air"  Brussels     London      67.0      32.0

   delays_3
0       NaN
1       NaN
2      87.0
3       NaN
4       NaN